RoR-Team-api/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Mauricio"], ["last_name", "Fuentes"], ["created_at", "2022-08-13 01:37:57.934188"], ["updated_at", "2022-08-13 01:37:57.934188"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "11111"], ["last_name", "11111"], ["updated_at", "2022-08-13 01:44:07.470018"], ["id", 1]]